# More Practice with Splits

In [4]:
import pandas as pd

In [5]:
chicago = pd.read_csv('chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category')
chicago.head(n=2)

                Name    Position Title   Department Employee Annual Salary
0    AARON,  ELVIA J  WATER RATE TAKER  WATER MGMNT              $90744.00
1  AARON,  JEFFERY M    POLICE OFFICER       POLICE              $84450.00

In [4]:
chicago['Name'].str.split(',').str.get(0)

0            AARON
1            AARON
2            AARON
3            AARON
4          ABAD JR
           ...
32057      ZYGADLO
32058     ZYGOWICZ
32059     ZYMANTAS
32060    ZYRKOWSKI
32061    ZYSKOWSKI
Name: Name, Length: 32062, dtype: object

In [5]:
chicago['Name'].str.split(',').str.get(0).value_counts().head(n=3)

WILLIAMS    293
JOHNSON     244
SMITH       241
Name: Name, dtype: int64

In [6]:
chicago['Name'].str.split(',').str.get(0).str.split(' ').str.get(0).value_counts().head()

MC          443
WILLIAMS    311
JOHNSON     256
SMITH       250
O           204
Name: Name, dtype: int64

In [7]:
chicago['Name'].str.split(',')

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32057    [ZYGADLO,   MICHAEL J]
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [10]:
chicago['Name'].str.split(',').str.get(1).head(n=14)

0           ELVIA J
1         JEFFERY M
2            KARINA
3       KIMBERLEI R
4         VICENTE M
5            ANABEL
6          EMMANUEL
7           REECE E
8       CHRISTOPHER
9          ROBERT J
10          JAMES J
11          TERRY M
12          BETTY L
13         LYNISE M
Name: Name, dtype: object

In [11]:
chicago['Name'].str.split(',').str.get(1).str.split(' ')

0            [, , ELVIA, J]
1          [, , JEFFERY, M]
2              [, , KARINA]
3        [, , KIMBERLEI, R]
4          [, , VICENTE, M]
                ...
32057      [, , MICHAEL, J]
32058        [, , PETER, J]
32059         [, , MARK, E]
32060        [, , CARLO, E]
32061         [, , DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [12]:
chicago['Name'].str.split(',').str.get(1).str.strip()

0            ELVIA J
1          JEFFERY M
2             KARINA
3        KIMBERLEI R
4          VICENTE M
            ...
32057      MICHAEL J
32058        PETER J
32059         MARK E
32060        CARLO E
32061        DARIUSZ
Name: Name, Length: 32062, dtype: object

In [13]:
chicago['Name'].str.split(',').str.get(1).str.strip().str.strip().str.split(' ').str.get(0)

0            ELVIA
1          JEFFERY
2           KARINA
3        KIMBERLEI
4          VICENTE
           ...
32057      MICHAEL
32058        PETER
32059         MARK
32060        CARLO
32061      DARIUSZ
Name: Name, Length: 32062, dtype: object

In [14]:
chicago['Name'].str.split(',').str.get(1).str.strip().str.strip().str.split(' ').str.get(0).value_counts().head(n=6)

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
DAVID       506
Name: Name, dtype: int64

In [16]:
chicago['Name'].str.split(',').str.get(1).str.strip().str.strip().str.split(' ').str.get(0).str.title().value_counts().head(n=15)

Michael    1153
John        899
James       676
Robert      622
Joseph      537
David       506
Thomas      490
Daniel      472
William     397
Anthony     385
Kevin       331
Brian       320
Richard     314
Mark        310
Patrick     300
Name: Name, dtype: int64